# print(123 + 123)
# print(542 - 242)
# print(2 * 123)
# print(120 / 3)
# print('120 / 3')

# print("덧셈 결과 :",123 + 123)
# print("뺄셈 결과 :",542 - 242)
# print("곱셈 결과 :",2 * 123)
# print("나눗셈 결과 :",120 / 3)
# , 구분자 (데이터끼리 구분 할 때)

# print('12 + 54 =',12 + 54, '입니다')
# print('268 - 42 =',268 - 42,'입니다')
# print('2 * 23 =',2 * 23,'입니다')
# print('120 / 3 = 40.0 입니다')

# n진수
# 2진수 0~1 / 0b, 8진수 0~7 / 0o, 10진수 0~9, 16진수 0~15 / 0x, (10=a, 11=b, 12=c, 13=d, 14=e, 15=f)
# print(0b01111011)
# print(0o173)
# print(0x7b)
# print(123)

# print("2진수 :",bin(0b01111011))
# print("8진수 :",oct(0b01111011))
# print("16진수 :",hex(0b01111011))
# print("10진수 :",0b0111011)
# 괄호는 안쪽에서 부터 봐야하며 그 다음 왼쪽 순서로 확인해봐야한다.

# print("%d" % 123)
# # print("%d %d " % 123)
# print("%d" % 123, 321)
# print("%d %d " % (123, 321))
# print("%d + %d = %d" % (123, 321, 123 + 321))

# print("10진 정수 : %d" % 123)
# print("10진 정수 : %d" % 0o173)
# print("10진 정수 : %d" % 0x7b)

# print("8진 정수 : %o" % 123)
# print("8진 정수 : %o" % 0o173)
# print("8진 정수 : %o" % 0x7b)

# print("16진 정수 : %x" % 123)
# print("16진 정수 : %x" % 0o173)
# print("16진 정수 : %x" % 0x7b)

# print("정수 표현 : %d" % 123)
# print("정수 표현 : %d" % 123.123)
# print("정수 표현 : %d %d" % (123,456))

# print("\n실수 표현 : %f" % 456)
# print("실수 표현 : %f" % 456.456)
# print("실수 표현 : %f %f" % (456.456, 123.123))

# print("문자 표현 : %c %c" % ("한","글"))
# print("문자 표현 : %c %c" % ("표","현"))

# print("\n문자열 표현 : %s" % "안녕")
# print("문자열 표현 : %s\t%s" % ("문자열",'표현 방식'))

# print("%c %c"% ("a","A"))
# print("%c %c"% (97,65))

# print("기본 값 :%d"%123)
# print("설정 값 :%5d"%123)
# print("설정 값 :%05d"%123)
# print("설정 값 :%5d %5d"%(123,123))
# print("설정 값 :%-5d %-5d"%(123,123))
# \t무조건 왼쪽 끝 정렬, %d 우측 정렬, %0d 우측 정렬 후 나머지는 0으로 채움, %-d 좌측 정렬 / %ad = a만큼 확보하여 정렬

# print("기본 값 :%f" % 123.45678)
# print("설정 값 :%10.3f" % 123.45678)
# # %a.bf 에서 a는 소수점을 포함한 전체 칸 확보
# # b는 표현 할 소수자리입니다. 다만 반올림 처리됩니다.
# print("설정 값 :%2.1f" % 123.45678)
# print("설정 값 :%.2f" % 123.45678)

# print("기본 값 :%s"%"python test")
# print("설정 값 :%20.3s"%"python test")
# print("12345678901234567890123456789012345678901234567890")
# print("%10s%10s"%("대한민국","만세"))

print("========= 출력 결과 =========\n")
print("이름  : %s" % ("홍길동"))
print("나이  : %d" % 20)
print("Tel   : %s" % ("010-1234-1234"))
print("키    : %.1f" % 178.5141412412532511212)
print("몸무게     : %d" % 75)
print("혈액형     : %c" % ("O"))
print("\n") # 아래는 추가 테스트용
print("Tel   : %s%d%c%d" % ('010-',1234,'-',1234))
print("키    : %s" % '178.5')
print("키    : %c%c%c%c%c" % ('1','7','8','.','5'))
print("몸무게","%5c %d" % (":",75))
print("혈액형","%5c %s" % (":","O"))