#주석이란?
#주석은 컴퓨터에게 전달하는 명령에서 예외처리 하는 문법입니다.
#주석은 행(줄)주석과 블럭 주석으로 나뉩니다.
#행주석은 #기호를 사용하며 #기호 두에 모두 주석 처리 됩니다.
#단, 줄이 바뀌면 해제됩니다.
#블럭주석은 """세개로 시작을 지정하고 """로 끝을 지정하면 그안에
#포함된 모든 내용이 주석 처리 됩니다.
print("오늘은 파이썬 첫날 ^^~~\\")#주석은 그 행의 설명을 작성하거나
#특정 코드를 예외처리합니다. print("오늘은 파이썬 첫날 ^^~~\\")
print("오늘은 파이썬 첫날 ^^~~\\")
"""
print("오늘은 파이썬 첫날 ^^~~\\")
print("오늘은 파이썬 첫날 ^^~~\\")
print("오늘은 파이썬 첫날 ^^~~\\")
print("오늘은 파이썬 첫날 ^^~~\\")"""
print("오늘은 파이썬 첫날 ^^~~\\")

#주석 단축기
#ctrl + / (토글(on/off)방식으로 주석처리)
#ctrl + k + c (주석이 누적 적용됨)
#ctrl + k + u (주석이 누적 해제됨)

# print("hello")
# print("python 첫날 입니다")
# print("python을 시작해 볼까요")

# print
# print("쌍다옴표 안의 내용 출력");print("이어 쓰기 실행")
# print("이어쓰기;");print();print(";(세미콜론이라고 읽는다)")
# ; = 마침표, 또는 다른 시작의 표시 (생략 가능)
# 가독성 떨어짐
# 에러 위치 확인 불가
# 결과 예측 불가

# *한 줄에 여러 명령 작성은 바람직하지 않으나
# 간결하면서 서로 연관성있으면 작성하기도 함

# \t 줄 간격 일치하게 할 때 사용

# print("Hello Python");
# print("Hello \nPython");
# print("재밌는");print("Python")

# print("Hello"
# "Python"
# "Start")

# print("Hello\n"
# "Python\n"
# "Start")

# print("저의 이름은 박제헌 입니다.\n저의 나이는 28살입니다.\n주소는 서울시 동대문구 입니다.")

# print("저의 이름은 박제헌 입니다.")
# print("저의 나의는 28살입니다.")
# print("주소는 서울시 동대문구 입니다.")

# print("12345678123456781234567812345678123456781234567812345678")
# print("Have\t""a\t""Good\t""Time.");
# print("1234567\t""1\t""12345678\t""123");
# print("대한민국\t만세\t만만세")
#한글은 2바이트 문자로 2칸 차지

# print("쌍 따옴표\"")
# print("홋 따옴표'")
# print('쌍 따옴표"')
# print('홋 따옴표\'')

# print('표현\방식')
# print('표현\1방식')
# print('표현\2방식')
# print('표현\3방식')
# print('표현\4방식')
# print('표현\5방식')
# print('표현\6방식')
# print('표현\7방식')
# print('표현\8방식')
# print('표현\9방식')
# print('표현\100방식')
# print('표현\b방식')
# print('표현\r방식')
# print('표현\2방식')
# print('표현\\2방식')
#print('표현 방식\')#error code
# print('표현 방식\\')

# print("=====================")
# print("\t /)""/)")
# print("\t(  ..)")
# print("\t(  >♡")
# print('  Have a Good Time.')
# print("=====================")

print('\t#### 회비 정보 #####')
print('==========================================')
print('이름\t나이\t전화번호\t회비')
print('==========================================')
print('홍길동\t"15"''\t010-123-1234''\t''\\20,000')
print('임꺽정\t"20"''\t010-234-2345''\t''\\30,000')
print('김말이\t"28"\t010-345-3456\t\\50,000')
print('------------------------------------------')
print('총합계\t\t\t\t\\100,000')
print('==========================================')